views/layouts/navbar.php

SELECT * FROM `user_profile` WHERE `user_id`=36
---
                    <span class="dropdown-header"><?=!Yii::$app->user->isGuest? Yii::$app->user->identity->username:""?></span>
                    <div class="dropdown-divider"></div>
                    <a href="#" class="dropdown-item">
                        <i><?= !Yii::$app->user->isGuest && \app\models\UserProfile::findOne(['user_id'=>Yii::$app->user->identity->id]) !== null? Html::a('Profile', ['user-profile/view/', 'id' => Yii::$app->user->identity->getProfileId()], ['class' => 'dropdown-item']) : "" ?></i>