controllers/FavoriteController.php

    public function actionCreate($product_id)
    {
        $model = new Favorite();
        $model->user_id = \Yii::$app->user->identity->id;
        $model->product_id = $product_id;
        if($model->save()){
            $product = Products::findOne(['id'=>$product_id]);
---
INSERT INTO `favorite` (`user_id`, `product_id`) VALUES (36, 4)
SELECT * FROM `products` WHERE `id`='4'