controllers/ProductsController.php

    protected function findModel($id)
    {
        if (($model = Products::findOne(['id' => $id])) !== null) {
---
SELECT * FROM `products` WHERE `id`='1'