controllers/ProductsController.php

    public function actionRate($id){
//        die();
        $model = Products::findOne(['id'=>$id]);
        $rate = Rate::findOne(['product_id'=>$id, 'user_id' => \Yii::$app->user->identity->id]);
        if($rate == null){
            $rate = new Rate();
            $rate->product_id = $id;
            $rate->user_id = \Yii::$app->user->identity->id;
        }
        $rate->time = time();
//        var_dump($rate->load(Yii::$app->request->post()));
//        die();
        if($rate->load(Yii::$app->request->post()) && $rate->save()){
---
SELECT * FROM `products` WHERE `id`='18'

    public function actionDetails($id) {
        $is_page_refreshed = (isset($_SERVER['HTTP_CACHE_CONTROL']) && $_SERVER['HTTP_CACHE_CONTROL'] == 'max-age=0');
        $product = $this->findModel($id);
//        var_dump(Yii::$app->session);
//        die();
        if(!$is_page_refreshed){
            if(!$product->increasingView($id)){
                $view = new View();
                $view->product_id = $id;
                $view->time = time();
                $view->count = 1;
                $view->save();

            }
        }
        if(!Yii::$app->user->isGuest) {
            $rate = Rate::findOne(['product_id' => $id, 'user_id' => \Yii::$app->user->identity->id]);
            if ($rate == null) {
                $rate = new Rate();
                $rate->product_id = $id;
                $rate->user_id = \Yii::$app->user->identity->id;
            }
            $rate->time = time();
//        var_dump($rate);
//        die();

            if ($rate->load(Yii::$app->request->post()) && $rate->save()) {
---
SELECT * FROM `rate` WHERE (`product_id`='5') AND (`user_id`=36)
SELECT * FROM `products` WHERE `id`='4'
INSERT INTO `rate` (`product_id`, `user_id`, `time`, `rate`) VALUES (5, 36, 1692672128, 4)
SELECT EXISTS(SELECT * FROM `products` WHERE `products`.`id`='5')
SELECT EXISTS(SELECT * FROM `user` WHERE `user`.`id`=36)

    protected function findModel($id)
    {
        if (($model = Products::findOne(['id' => $id])) !== null) {
---
SELECT * FROM `products` WHERE `id`='5'