controllers/UserProfileController.php

    protected function findModel($id)
    {
        if (($model = UserProfile::findOne(['id' => $id])) !== null) {
---
SELECT * FROM `user_profile` WHERE `id`='12'