views/site/category-details.php

SELECT * FROM `categories` WHERE `id`='1'
SELECT * FROM `categories` WHERE `id`='4'
---
/** @var app\models\search\ProductsSearch $searchModel */
/** @var yii\data\ActiveDataProvider $dataProvider */
$products = $dataProvider->getModels();
$category = \app\models\Categories::findOne(['id'=>Yii::$app->request->get('id')]);
$cates = \app\models\Categories::find()->all();

SELECT * FROM `user_profile` WHERE `user_id`=37
---
                                <i class="fa fa-user"></i> <span><?= Yii::$app->user->identity->username ?></span>
                                <ul class="sub-user">
                                    <a href="#">
                                        <i><?=\app\models\UserProfile::findOne(['user_id'=>Yii::$app->user->identity->id]) !== null? Html::a('Profile', ['user-profile/profile', 'id' => Yii::$app->user->identity->getProfileId()], ['class' => 'dropdown-item']) : "" ?></i>