views/site/categories.php

SELECT * FROM `categories`
---
/** @var yii\data\ActiveDataProvider $dataProvider */
//
$products = $dataProvider->getModels();
$cates = \app\models\Categories::find()->all();