views/site/home.php

                                <li><i class="fa fa-user"></i> <?= Yii::$app->user->identity->username ?></li>
                                <ul class="sub-user">
                                    <a href="#">
                                        <i><?=\app\models\UserProfile::findOne(['user_id'=>Yii::$app->user->identity->id]) !== null? Html::a('Profile', ['user-profile/update/', 'id' => Yii::$app->user->identity->getProfileId()], ['class' => 'dropdown-item']) : "" ?></i>
---
SELECT * FROM `user_profile` WHERE `user_id`=36

                            <div class="product__item__text">
                                <h6><a href="<?= Url::to(['products/view', 'id' => $product->id]) ?>"><?= $product->name ?></a></h6>
                                <?php
                                    $view = \app\models\View::findOne(['product_id'=> $product->id]);
---
SELECT * FROM `view` WHERE `product_id`=1