views/site/home2.php

                                <ul class="sub-user">
                                    <!--                                    <a href="#">-->
                                    <li></li>
                                    <li><?= \app\models\UserProfile::findOne(['user_id' => Yii::$app->user->identity->id]) !== null ? Html::a('Thông tin', ['user-profile/update/', 'id' => Yii::$app->user->identity->getProfileId()], ['class' => 'dropdown-item']) : "" ?></li>
---
SELECT * FROM `user_profile` WHERE `user_id`=36