views/site/index.php

            ['class' => 'product-link']
        );
        echo Html::tag('div', $model->name, ['class' => 'product-name']);
        $view = \app\models\View::findOne(['product_id'=> $model->id]);
---
SELECT * FROM `view` WHERE `product_id`=1