models/form/ProductForm.php

UPDATE `products` SET `avatar`='products/18-mmmm/avatar-download1689842034.jpg', `image_360`='products/18-mmmm/image360-image11689842034.jpeg' WHERE `id`=18
UPDATE `products` SET `category_id`=2, `status`=1, `avatar`='avatar/4213791.fig.0021688391612.png', `image_360`='image_360/CamScanner-05-11-2023-10.221688391612.pdf' WHERE `id`=1
SELECT * FROM `qrcode` WHERE `product_id`=18
---
                $path_file360 = $folder . '/' . 'image360-' .$this->image_360->baseName.time(). '.' . $this->image_360->extension;
                $model->image_360 = $path_file360;
                $model->avatar = $path_avatar;
                $this->avatar->saveAs($path_avatar);
                $this->image_360->saveAs($path_file360);

                $model->save();

                if((Qrcode::findOne(['product_id'=>$this->id])) == null){