views/products/details.php

SELECT * FROM `user_profile` WHERE `user_id`=36
---
                                  <ul class="sub-user">
                                      <!--                                    <a href="#">-->
                                      <li></li>
                                      <li><?= \app\models\UserProfile::findOne(['user_id' => Yii::$app->user->identity->id]) !== null ? Html::a('Thông tin', ['user-profile/update/', 'id' => Yii::$app->user->identity->getProfileId()], ['class' => 'dropdown-item']) : "" ?></li>

SELECT * FROM `rate` WHERE (`product_id`=5) AND (`user_id`=36)
---
                                  <?php $form = ActiveForm::begin(['options'=>['id'=>'rate-product']]); ?>
                                  <?php

                                  echo StarRating::widget([
                                      'name' => 'Rate[rate]',
                                      'model' => $rate,
                                      'attribute' => 'rate',
                                      'value'=> \app\models\base\Rate::findOne(['product_id'=>$model->id, 'user_id'=>Yii::$app->user->identity->id])->rate,
                                      'pluginOptions' => [
                                          'stars' => 5,
                                          'min' => 0,
                                          'max' => 5,
                                          'step' => 1,
                                          'symbol' => html_entity_decode('&#xe005;', ENT_QUOTES, "utf-8"),
                                          'defaultCaption' => '{rating} sao',
                                          'starCaptions'=>[],
                                          'starCaptionsCallback' => new yii\web\JsExpression('function(rating, index) {
                                                                                                    return index;
                                                                                                }'),
                                          'starClickedCallback' => new yii\web\JsExpression('function(rating, index) {
                                                $("#rating-input").val(rating);
                                            }'),
                                      ],
                                      'options' => ['class' => 'form-control']
                                  ]);

SELECT * FROM `favorite` WHERE `product_id`=5
---
                          ActiveForm::begin();
                          if(!Yii::$app->user->isGuest && $model->isFavorite()){
                              echo Html::a('Loại khỏi danh sách yêu thích',
                                  ['favorite/delete', 'id' => \app\models\base\Favorite::findOne(['product_id'=>$model->id])->id],