views/products/index.php

SELECT * FROM `categories` WHERE `id`=2
---
                    'label' => 'Tên sản phẩm'
            ],
//            'category_id',
            [
                'attribute' => 'category_id',
                'label'=>'Phân loại',
                'filter' => Html::activeDropDownList(
                    $searchModel,
                    'category_id',
                    \app\models\Products::getCate(),
                    ['class' => 'form-control', 'prompt' => 'All']
                ),
                'value' => function ($model) {
//                    return Categories::findOne(['id'=> $model->category_id])->name;
                    return $model->getCategory();
                },
            ],

SELECT * FROM `qrcode` WHERE `product_id`=1
SELECT * FROM `qrcode` WHERE `product_id`=16
---
            ],
//            'avatar',
            //'image_360',
            [
                'label' => 'QR code',
                'attribute' => 'image_360',
                'filter' => false,
                'format' => 'raw',
                'value' => function ($model) {
                    $qr = \app\models\base\Qrcode::findOne(['product_id'=>$model->id]);
                    if($qr !== null){
                        $path = $qr->qr;
                        return Html::a(Html::img($path, ['width' => '80']));
                    }
                    return 'null';
                    }
            ],