models/Products.php

SELECT * FROM `view` WHERE `product_id`=1
---
    public function  getViews(): int
    {
        $view = View::findOne(['product_id' => $this->id]);