models/Products.php

SELECT * FROM `categories`
---
    public static function getCate()
    {
        $cate = Categories::find()->all();

SELECT * FROM `categories`
---
    public static function getCategories(){
        $cate = Categories::find()->all();

SELECT EXISTS(SELECT * FROM `products` WHERE `products`.`id`=4)
SELECT * FROM `view` WHERE `product_id`='5'
UPDATE `view` SET `count`=21, `time`=1692672118 WHERE `id`=11
---
    public function increasingView($product_id){
        if(($view = View::findOne(['product_id'=>$product_id]))){
            $lastSeen = $view->time;
            $view->time = time();
//            if($view->lastSeen == Yii::$app->user->identity->id){
                if($view->time - $lastSeen >= 120){
                    $view->count += 1;
                }
//            } else{
//                $view->count += 1;
//            }
//            $view->lastSeen=Yii::$app->user->identity->id;
            if($view->save()){

SELECT * FROM `categories` WHERE `id`=5
---
    public function getCategory()
    {
        return (string)Categories::findOne(['id'=> $this->category_id])->name;

SELECT * FROM `qrcode` WHERE `product_id`=5
---
    public function getQrcodes(){
        return \app\models\base\Qrcode::findOne(['product_id'=>$this->id]);

SELECT * FROM `view` WHERE `product_id`=5
---
    public function  getViews(): int
    {
        $view = View::findOne(['product_id' => $this->id]);

SELECT * FROM `products` WHERE (`category_id`=5) AND (`id` <> 5) LIMIT 4
---
    public function getProductOfCate($cate, $limit){
        return Products::find()->where(['category_id'=>$cate])->andWhere(['<>', 'id', $this->id])->limit($limit)->all();

SELECT AVG(rate) FROM `rate` WHERE `product_id`=5
---
    public function getRate(){
        $rates = Rate::find()->where(['product_id'=> $this->id]);

SELECT COUNT(*) FROM `rate` WHERE `product_id`=5
---
    public function countRate(){
        return (int) Rate::find()->where(['product_id'=> $this->id])->count();

SELECT `product_id`, AVG(rate) AS avg_rating FROM `rate` GROUP BY `product_id` ORDER BY `avg_rating` DESC
SELECT * FROM `products` WHERE `id` IN (8, 9, 18, 6, 19, 1, 4, 5) LIMIT 10
SELECT * FROM `products` WHERE (`id` IN (8, 9, 18, 6, 19, 1, 4, 5)) AND (`created_by`='tesss') LIMIT 10
---
    public static function getTopRate(){
        $top = Rate::find()
            ->select(['product_id', new Expression('AVG(rate) AS avg_rating')])
            ->groupBy('product_id')
            ->orderBy(['avg_rating' => SORT_DESC])
//            ->limit(10)
            ->all();
        $productIds = ArrayHelper::getColumn($top, 'product_id');
        if(Yii::$app->user->can('admin')){
            $topProducts = Products::find()
                ->where(['id' => $productIds])
                ->limit(10)
                ->all();
        } else{
            $topProducts = Products::find()
                ->where(['id' => $productIds])
                ->andWhere(['created_by'=>Yii::$app->user->identity->username])
                ->limit(10)
                ->all();

SELECT COUNT(*) FROM `rate` WHERE (`product_id`=5) AND (`rate`=5)
---
    public function getEachRate($rate)
    {
        $result = Rate::find()->where(['product_id'=>$this->id])->andWhere(['rate'=>$rate])->count();
        return (int) Rate::find()->where(['product_id'=>$this->id])->andWhere(['rate'=>$rate])->count();