models/User.php

SELECT * FROM `user` WHERE `id`=36
---
    public static function findIdentity($id)
    {
        return self::findOne($id);

SELECT * FROM `favorite` WHERE `user_id`=36
SELECT * FROM `products` WHERE `id`=1
---
    public function getFavorite(){
        $favorite = Favorite::find()->where(['user_id'=>$this->id])->all();
        $list = [];
        foreach ($favorite as $item){
            $list[] = Products::findOne(['id'=>$item->product_id]);

SELECT COUNT(*) FROM `products`
SELECT COUNT(*) FROM `products` WHERE `created_by`='tesss'
---
    public static  function countProducts(){
        if(Yii::$app->user->can('admin')){
            return Products::find()->count();
        }
        return Products::find()->where(['created_by'=>Yii::$app->user->identity->username])->count();

SELECT * FROM `user_profile` WHERE `user_id`=36
---
    public function getUserProfiles(){
        return UserProfile::findOne(['user_id'=>$this->id]);