models/View.php

    public static function getPercent(){
        $query = new Query();
        $querySum = new Query();
        if(!Yii::$app->user->can('admin')){
            $query->select('SUM(view.count)')
                ->where(['products.created_by'=>Yii::$app->user->identity->username])
                ->from('products')
                ->leftJoin('view', 'products.id = view.product_id')
                ->leftJoin('categories', 'products.category_id = categories.id')
                ->groupBy('categories.name');
            $sum = $querySum->select('SUM(view.count)')
                ->where(['created_by'=>Yii::$app->user->identity->username])
                ->from('products')
                ->leftJoin('view', 'products.id = view.product_id')
                ->scalar();
        } else{
            $query->select('SUM(view.count)')
                ->from('products')
                ->leftJoin('view', 'products.id = view.product_id')
                ->leftJoin('categories', 'products.category_id = categories.id')
                ->groupBy('categories.name');
            $sum = View::find()->sum('count');
---
SELECT SUM(view.count) FROM `products` LEFT JOIN `view` ON products.id = view.product_id WHERE `created_by`='tesss'
SELECT * FROM `products` WHERE `id` IN (1, 6, 12, 14, 15, 13, 4, 16)
SELECT SUM(view.count) FROM `products` LEFT JOIN `view` ON products.id = view.product_id LEFT JOIN `categories` ON products.category_id = categories.id WHERE `products`.`created_by`='tesss' GROUP BY `categories`.`name`
SELECT SUM(count) FROM `view`

    public static function getTop(){
        $top = View::find()->orderBy(['count' => SORT_DESC])->limit(10)->all();
        $productIds = ArrayHelper::getColumn($top, 'product_id');
        if(Yii::$app->user->can('admin')){
            $topProducts = Products::find()
                ->where(['id' => $productIds])
                ->all();

        } else{
            $topProducts = Products::find()
                ->where(['id' => $productIds])->andWhere(['created_by'=>Yii::$app->user->identity->username])
                ->all();
---
SELECT * FROM `view` ORDER BY `count` DESC LIMIT 10
SELECT * FROM `products` WHERE `id` IN (1, 4, 6, 5, 12, 19, 14, 15, 13, 16)
SELECT * FROM `products` WHERE (`id` IN (1, 6, 4, 5, 12, 19, 14, 15, 13, 16)) AND (`created_by`='tesss')

    public static function getTotalView(){
        if(Yii::$app->user->can('admin')){
            return $sum = View::find()->sum('count');
        }
        $querySum = new Query();
        return $querySum->select('SUM(view.count)')
            ->where(['created_by'=>Yii::$app->user->identity->username])
            ->from('products')
            ->leftJoin('view', 'products.id = view.product_id')
            ->scalar();
---
SELECT SUM(count) FROM `view`
SELECT SUM(view.count) FROM `products` LEFT JOIN `view` ON products.id = view.product_id WHERE `created_by`='tesss'