models/View.php

    public static function getTop(){
        $top = View::find()->orderBy(['count' => SORT_DESC])->limit(10)->all();
---
SELECT * FROM `view` ORDER BY `count` DESC LIMIT 10